IDEA Connection Link
ConnectionSrv.GetWeldStress Method
 Weld curve for weld ID and connection
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public List<double[]> GetWeldStress(
	Guid connectionId,
	int weldId
)
Public Function GetWeldStress (
	connectionId As Guid,
	weldId As Integer
) As List(Of Double())
public:
List<array<double>^>^ GetWeldStress(
	Guid connectionId,
	int weldId
)
Parameters
connectionId
Type: System.Guid
Connection ID
weldId
Type: System.Int32
Weld ID
Return Value
Type: List<Double[]>
[Missing <returns> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.GetWeldStress(System.Guid,System.Int32)"]
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace